tap "borgbackup/tap"
tap "oven-sh/bun"

# fonts
cask "font-fira-code"
cask "font-fira-sans"
cask "font-fira-code-nerd-font"
cask "font-lora"

# shell
brew "fish"
brew "starship"

# powertools
brew "just"
brew "eza"
brew "zoxide"
brew "bat"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "sk"
brew "jq"

# git setup and useful plugins
brew "git"
brew "git-lfs"
brew "git-crypt"
brew "git-filter-repo"
brew "git-absorb"

# python setup
brew "python@3.13"
brew "python@3.12"
brew "python@3.11"
brew "python@3.10"
brew "python@3.9"
brew "python-packaging"
# prefer to install global packages/tools with uv
brew "uv"

# node setup
brew "fnm"
brew "oven-sh/bun/bun"

# rust setup
brew "rustup-init"
brew "sccache"

brew "age"
brew "openssl@3"
brew "autoconf"
brew "automake"
brew "protobuf"
brew "grpc"
brew "bear"
brew "boost"
brew "cmake"
brew "cmake-docs"
brew "lima"
brew "colima", restart_service: :changed
brew "curl"
brew "dialog"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "duckdb"
brew "elan-init"
brew "gnutls"
brew "enet"
brew "exiftool"
brew "libssh"
brew "opus"
brew "sdl2"
brew "ffmpeg"
brew "gcc"
brew "libusb"
brew "gh"
brew "pinentry"
brew "gnupg"
brew "go"
brew "pkgconf"
brew "libheif"
brew "iperf3"
brew "libopusenc"
brew "llvm"
brew "mkcert"
brew "ninja"
brew "pinentry-mac"
brew "pulseaudio"
brew "qemu"
brew "spicetify-cli"
brew "vpn-slice"
brew "wget"

cask "basictex"
cask "chromedriver"
cask "cursor"
cask "visual-studio-code"
cask "iina"
cask "keka"
cask "logi-options+"
cask "macfuse"
cask "spotify"
cask "utm"

vscode "astro-build.astro-vscode"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "humao.rest-client"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "nefrob.vscode-just-syntax"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "zxh404.vscode-proto3"
